>> % Вхідні дані: [зріст; вага]
P = [160 165 170 168 155 175 180 185 190 200; % зріст

50 60 65 55 58 70 80 85 90 100]; % вага


% Вихідні мітки класів:
% 0 — жокей, 1 — баскетболіст T = [0 0 0 0 0 1 1 1 1 1];
>> % Створення персептрона net = perceptron;
net.trainFcn = 'trainc';	% конкурентне навчання net.adaptFcn = 'adaptwb';	% адаптація ваг
net.inputWeights{1,1}.learnFcn = 'learnpn'; % функція навчання learnpn net.biases{1}.learnFcn = 'learnpn';

% Навчання мережі net = train(net, P, T);
>> % Тестування Y = net(P);
disp('Очікувані результати:'); disp(T);
disp('Отримані результати:'); disp(Y);
